## Terraform Plan Result


### environments/stg/network/sg
```
  + create
  ~ update in-place
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "stg-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-southeast-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-alb-sg"
          + "Project"     = "STP-2025"
      + tags_all               = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-alb-sg"
          + "Project"     = "STP-2025"
      + vpc_id                 = "vpc-07fd028d1425bded5"
  + resource "aws_security_group_rule" "this_use_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
      + description              = "Allow HTTP from anywhere"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
  ~ resource "aws_security_group" "this" {
      ~ tags                   = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Project"     = "STP-2025"
      ~ tags_all               = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Project"     = "STP-2025"
  ~ resource "aws_security_group" "this" {
      ~ tags                   = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Project"     = "STP-2025"
      ~ tags_all               = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Project"     = "STP-2025"
Plan: 2 to add, 2 to change, 0 to destroy.
```
<!-- Sticky Pull Request Commentterraform-plan -->